diffuser-mesh/baseCase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 216;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 216;
    }
    outlet
    {
        type            zeroGradient;
    }
    compressor
    {
        type            zeroGradient;
    }
    upper
    {
        type            zeroGradient;
    }
    lower
    {
        type            zeroGradient;
    }
    cowl
    {
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
