diffuser-mesh/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          117;
        startFace       55013;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       55130;
    }
    compressor
    {
        type            patch;
        nFaces          70;
        startFace       55170;
    }
    upper
    {
        type            patch;
        nFaces          220;
        startFace       55240;
    }
    lower
    {
        type            patch;
        nFaces          100;
        startFace       55460;
    }
    cowl
    {
        type            patch;
        nFaces          77;
        startFace       55560;
    }
    axis
    {
        type            patch;
        nFaces          150;
        startFace       55637;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          55400;
        startFace       55787;
    }
)

// ************************************************************************* //
