diffuser-mesh/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
LsO 0.20791169;
ULcO 2.92814760;
DLcO 2.97814760;
TLcO 3.97814760;

z1  0.0; 
z2  0.1; 
Nup   80;
Nuu   40;
Ncowl 20;
Naxis 150;
Ninf  200;
Nramp 200;
Ndown 100;

convertToMeters 1;

vertices
(
	(1.0	0.0		$z1) // Point 0
	(2.0	0.0		$z1) // Point 1
	($DLcO	$LsO	$z1) // Point 2
	($TLcO	0.1		$z1) // Point 3
	(1.0	0.8		$z1) // Point 4
	(2.0	0.8		$z1) // Point 5
	($DLcO	0.8		$z1) // Point 6
	($TLcO	0.8		$z1) // Point 7
	(1.0	0.85	$z1) // Point 8
	(2.0	0.85	$z1) // Point 9
	($ULcO	0.85	$z1) // Point 10
	($TLcO	0.85	$z1) // Point 11
	(1.0	1.85	$z1) // Point 12
	(2.0	1.85	$z1) // Point 13
	($ULcO	1.85	$z1) // Point 14
	($TLcO	1.85	$z1) // Point 15

	(1.0	0.0		$z2) // Point 16
	(2.0	0.0		$z2) // Point 17
	($DLcO	$LsO	$z2) // Point 18
	($TLcO	0.1		$z2) // Point 19
	(1.0	0.8		$z2) // Point 20
	(2.0	0.8		$z2) // Point 21
	($DLcO	0.8		$z2) // Point 22
	($TLcO	0.8		$z2) // Point 23
	(1.0	0.85	$z2) // Point 24
	(2.0	0.85	$z2) // Point 25
	($ULcO	0.85	$z2) // Point 26
	($TLcO	0.85	$z2) // Point 27
	(1.0	1.85	$z2) // Point 28
	(2.0	1.85	$z2) // Point 29
	($ULcO	1.85	$z2) // Point 30
	($TLcO	1.85	$z2) // Point 31
);

blocks
(
	//block 0
    hex (0 1 5 4 16 17 21 20) ($Ninf $Naxis 1) simpleGrading
    (
    	0.1
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )    
    //block 1
    hex (1 2 6 5 17 18 22 21) ($Nramp $Naxis 1) simpleGrading
    (
    	1
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )
    //block 2
    hex (2 3 7 6 18 19 23 22) ($Ndown $Naxis 1) simpleGrading 		
    (
    	10
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )
    //block 3
    hex (4 5 9 8 20 21 25 24) ($Ninf $Ncowl 1) simpleGrading (0.1 1 1)
    //block 4
    hex (5 6 10 9 21 22 26 25) ($Nramp $Ncowl 1) simpleGrading (1 1 1)
    //block 5
    hex (8 9 13 12 24 25 29 28) ($Ninf $Nup 1) simpleGrading (0.1 15 1)
    //block 6
    hex (9 10 14 13 25 26 30 29) ($Nramp $Nup 1) simpleGrading (1 15 1)
    //block 7
    hex (10 11 15 14 26 27 31 30) ($Nuu $Nup 1) simpleGrading (10 15 1)
);

edges
(    spline 2 3 ( 
        (2.97814760 0.20791169 0.0) 
        (2.98824861 0.20725328 0.0) 
        (2.99834962 0.20658605 0.0) 
        (3.00845063 0.20591002 0.0) 
        (3.01855164 0.20522518 0.0) 
        (3.02865265 0.20453154 0.0) 
        (3.03875366 0.20382908 0.0) 
        (3.04885467 0.20311782 0.0) 
        (3.05895568 0.20239775 0.0) 
        (3.06905669 0.20166887 0.0) 
        (3.07915770 0.20093118 0.0) 
        (3.08925871 0.20018468 0.0) 
        (3.09935972 0.19942938 0.0) 
        (3.10946073 0.19866526 0.0) 
        (3.11956174 0.19789234 0.0) 
        (3.12966275 0.19711061 0.0) 
        (3.13976376 0.19632007 0.0) 
        (3.14986477 0.19552073 0.0) 
        (3.15996578 0.19471257 0.0) 
        (3.17006679 0.19389561 0.0) 
        (3.18016780 0.19306984 0.0) 
        (3.19026881 0.19223526 0.0) 
        (3.20036982 0.19139188 0.0) 
        (3.21047083 0.19053968 0.0) 
        (3.22057184 0.18967868 0.0) 
        (3.23067285 0.18880887 0.0) 
        (3.24077386 0.18793025 0.0) 
        (3.25087487 0.18704282 0.0) 
        (3.26097588 0.18614658 0.0) 
        (3.27107689 0.18524154 0.0) 
        (3.28117790 0.18432768 0.0) 
        (3.29127891 0.18340502 0.0) 
        (3.30137992 0.18247355 0.0) 
        (3.31148093 0.18153328 0.0) 
        (3.32158194 0.18058419 0.0) 
        (3.33168295 0.17962630 0.0) 
        (3.34178396 0.17865960 0.0) 
        (3.35188497 0.17768409 0.0) 
        (3.36198598 0.17669977 0.0) 
        (3.37208699 0.17570664 0.0) 
        (3.38218800 0.17470471 0.0) 
        (3.39228901 0.17369396 0.0) 
        (3.40239002 0.17267441 0.0) 
        (3.41249104 0.17164605 0.0) 
        (3.42259205 0.17060888 0.0) 
        (3.43269306 0.16956291 0.0) 
        (3.44279407 0.16850812 0.0) 
        (3.45289508 0.16744453 0.0) 
        (3.46299609 0.16637213 0.0) 
        (3.47309710 0.16529092 0.0) 
        (3.48319811 0.16420090 0.0) 
        (3.49329912 0.16310208 0.0) 
        (3.50340013 0.16199445 0.0) 
        (3.51350114 0.16087800 0.0) 
        (3.52360215 0.15975275 0.0) 
        (3.53370316 0.15861870 0.0) 
        (3.54380417 0.15747583 0.0) 
        (3.55390518 0.15632416 0.0) 
        (3.56400619 0.15516367 0.0) 
        (3.57410720 0.15399438 0.0) 
        (3.58420821 0.15281628 0.0) 
        (3.59430922 0.15162937 0.0) 
        (3.60441023 0.15043366 0.0) 
        (3.61451124 0.14922913 0.0) 
        (3.62461225 0.14801580 0.0) 
        (3.63471326 0.14679366 0.0) 
        (3.64481427 0.14556271 0.0) 
        (3.65491528 0.14432296 0.0) 
        (3.66501629 0.14307439 0.0) 
        (3.67511730 0.14181702 0.0) 
        (3.68521831 0.14055084 0.0) 
        (3.69531932 0.13927585 0.0) 
        (3.70542033 0.13799205 0.0) 
        (3.71552134 0.13669944 0.0) 
        (3.72562235 0.13539803 0.0) 
        (3.73572336 0.13408781 0.0) 
        (3.74582437 0.13276878 0.0) 
        (3.75592538 0.13144094 0.0) 
        (3.76602639 0.13010429 0.0) 
        (3.77612740 0.12875883 0.0) 
        (3.78622841 0.12740457 0.0) 
        (3.79632942 0.12604150 0.0) 
        (3.80643043 0.12466962 0.0) 
        (3.81653144 0.12328893 0.0) 
        (3.82663245 0.12189943 0.0) 
        (3.83673346 0.12050113 0.0) 
        (3.84683447 0.11909402 0.0) 
        (3.85693548 0.11767810 0.0) 
        (3.86703649 0.11625337 0.0) 
        (3.87713750 0.11481983 0.0) 
        (3.88723851 0.11337748 0.0) 
        (3.89733952 0.11192633 0.0) 
        (3.90744053 0.11046637 0.0) 
        (3.91754154 0.10899760 0.0) 
        (3.92764255 0.10752002 0.0) 
        (3.93774356 0.10603363 0.0) 
        (3.94784457 0.10453843 0.0) 
        (3.95794558 0.10303443 0.0) 
        (3.96804659 0.10152162 0.0) 
        (3.97814760 0.10000000 0.0) 
        ) 
    spline 18 19 ( 
        (2.97814760 0.20791169 0.1) 
        (2.98824861 0.20725328 0.1) 
        (2.99834962 0.20658605 0.1) 
        (3.00845063 0.20591002 0.1) 
        (3.01855164 0.20522518 0.1) 
        (3.02865265 0.20453154 0.1) 
        (3.03875366 0.20382908 0.1) 
        (3.04885467 0.20311782 0.1) 
        (3.05895568 0.20239775 0.1) 
        (3.06905669 0.20166887 0.1) 
        (3.07915770 0.20093118 0.1) 
        (3.08925871 0.20018468 0.1) 
        (3.09935972 0.19942938 0.1) 
        (3.10946073 0.19866526 0.1) 
        (3.11956174 0.19789234 0.1) 
        (3.12966275 0.19711061 0.1) 
        (3.13976376 0.19632007 0.1) 
        (3.14986477 0.19552073 0.1) 
        (3.15996578 0.19471257 0.1) 
        (3.17006679 0.19389561 0.1) 
        (3.18016780 0.19306984 0.1) 
        (3.19026881 0.19223526 0.1) 
        (3.20036982 0.19139188 0.1) 
        (3.21047083 0.19053968 0.1) 
        (3.22057184 0.18967868 0.1) 
        (3.23067285 0.18880887 0.1) 
        (3.24077386 0.18793025 0.1) 
        (3.25087487 0.18704282 0.1) 
        (3.26097588 0.18614658 0.1) 
        (3.27107689 0.18524154 0.1) 
        (3.28117790 0.18432768 0.1) 
        (3.29127891 0.18340502 0.1) 
        (3.30137992 0.18247355 0.1) 
        (3.31148093 0.18153328 0.1) 
        (3.32158194 0.18058419 0.1) 
        (3.33168295 0.17962630 0.1) 
        (3.34178396 0.17865960 0.1) 
        (3.35188497 0.17768409 0.1) 
        (3.36198598 0.17669977 0.1) 
        (3.37208699 0.17570664 0.1) 
        (3.38218800 0.17470471 0.1) 
        (3.39228901 0.17369396 0.1) 
        (3.40239002 0.17267441 0.1) 
        (3.41249104 0.17164605 0.1) 
        (3.42259205 0.17060888 0.1) 
        (3.43269306 0.16956291 0.1) 
        (3.44279407 0.16850812 0.1) 
        (3.45289508 0.16744453 0.1) 
        (3.46299609 0.16637213 0.1) 
        (3.47309710 0.16529092 0.1) 
        (3.48319811 0.16420090 0.1) 
        (3.49329912 0.16310208 0.1) 
        (3.50340013 0.16199445 0.1) 
        (3.51350114 0.16087800 0.1) 
        (3.52360215 0.15975275 0.1) 
        (3.53370316 0.15861870 0.1) 
        (3.54380417 0.15747583 0.1) 
        (3.55390518 0.15632416 0.1) 
        (3.56400619 0.15516367 0.1) 
        (3.57410720 0.15399438 0.1) 
        (3.58420821 0.15281628 0.1) 
        (3.59430922 0.15162937 0.1) 
        (3.60441023 0.15043366 0.1) 
        (3.61451124 0.14922913 0.1) 
        (3.62461225 0.14801580 0.1) 
        (3.63471326 0.14679366 0.1) 
        (3.64481427 0.14556271 0.1) 
        (3.65491528 0.14432296 0.1) 
        (3.66501629 0.14307439 0.1) 
        (3.67511730 0.14181702 0.1) 
        (3.68521831 0.14055084 0.1) 
        (3.69531932 0.13927585 0.1) 
        (3.70542033 0.13799205 0.1) 
        (3.71552134 0.13669944 0.1) 
        (3.72562235 0.13539803 0.1) 
        (3.73572336 0.13408781 0.1) 
        (3.74582437 0.13276878 0.1) 
        (3.75592538 0.13144094 0.1) 
        (3.76602639 0.13010429 0.1) 
        (3.77612740 0.12875883 0.1) 
        (3.78622841 0.12740457 0.1) 
        (3.79632942 0.12604150 0.1) 
        (3.80643043 0.12466962 0.1) 
        (3.81653144 0.12328893 0.1) 
        (3.82663245 0.12189943 0.1) 
        (3.83673346 0.12050113 0.1) 
        (3.84683447 0.11909402 0.1) 
        (3.85693548 0.11767810 0.1) 
        (3.86703649 0.11625337 0.1) 
        (3.87713750 0.11481983 0.1) 
        (3.88723851 0.11337748 0.1) 
        (3.89733952 0.11192633 0.1) 
        (3.90744053 0.11046637 0.1) 
        (3.91754154 0.10899760 0.1) 
        (3.92764255 0.10752002 0.1) 
        (3.93774356 0.10603363 0.1) 
        (3.94784457 0.10453843 0.1) 
        (3.95794558 0.10303443 0.1) 
        (3.96804659 0.10152162 0.1) 
        (3.97814760 0.10000000 0.1) 
        ) 

);

boundary
(
	inlet
    {
        type patch;
        faces
        (
            (12 28 24 8)
            (8 24 20 4)
            (4 20 16 0)
        );
    }   

	outlet
    {
        type patch;
        faces
        (
            (31 15 11 27)
        );
    }   

	compressor
    {
        type patch;
        faces
        (
            (23 7 3 19)
        );
    }   

	upper
    {
        type patch;
        faces
        (
            (28 12 13 29)
            (29 13 14 30)
            (30 14 15 31)
        );
    }   

	lower
    {
        type patch;
        faces
        (
            (0 16 17 1)
        );
    }   
    
	cowl
    {
        type patch;
        faces
        (
            (10 26 27 11)
            (26 10 6 22)
            (22 6 7 23)
        );
    }   

	axis
    {
        type patch;
        faces
        (
            (18 2 1 17)
            (19 3 2 18)
        );
    }   
);

// ************************************************************************* //
